---
title: Glazing
classe: Autodesk.Revit.DB.Visual.Glazing
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# Glazing

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CommonTintColor { get; }` | `Glazing.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `Glazing.CommonTintToggle` | String |
| `String GlazingColorByObject { get; }` | `Glazing.GlazingColorByObject` | String |
| `String GlazingNoLevels { get; }` | `Glazing.GlazingNoLevels` | String |
| `String GlazingReflectance { get; }` | `Glazing.GlazingReflectance` | String |
| `String GlazingTransmittanceColor { get; }` | `Glazing.GlazingTransmittanceColor` | String |
| `String GlazingTransmittanceMap { get; }` | `Glazing.GlazingTransmittanceMap` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```